case/dummyTestCase/0.org/beam/m
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      m;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type calculated;
        value uniform (0 0 0);
    }

    right
    {
        type calculated;
        value uniform (0 0 0);
    }

    beam
    {
        type empty;
    }
}


// ************************************************************************* //
